      *================================================================*
       IDENTIFICATION                  DIVISION.
      *================================================================*
       PROGRAM-ID. HBSI20BO.
       AUTHOR.     TADEU COSTA DE OLIVEIRA.
      *================================================================*
      *           A V A L I A C A O - H B S I S / A M B E V            *
      *----------------------------------------------------------------*
      *    PROGRAMA....: HBSI20BO                                      *
      *    PROGRAMADOR.: TADEU COSTA DE OLIVEIRA                       *
      *    DATA........: 25/03/2019                                    *
      *----------------------------------------------------------------*
      *    OBJETIVO....: PROGRAMA PARA CADASTRO DE VENDEDORES          *                                                                          
      *----------------------------------------------------------------*
      *    BOOKS USADOS:                                               *
      *    HBSINXXX - DESCRICAO DO BOOK                                *
      *----------------------------------------------------------------*
      *    MODULOS.....:                                               *
      *    HBSINXXX - DESCRICAO DO MODULO                              *
      *================================================================*
      *
      *================================================================*
       ENVIRONMENT                     DIVISION.
      *================================================================*
      *                                                                *
      *----------------------------------------------------------------*
       CONFIGURATION                   SECTION.
      *----------------------------------------------------------------*
      *
       SPECIAL-NAMES.
           DECIMAL-POINT               IS COMMA.
      *
      *================================================================*
       DATA                            DIVISION.
      *================================================================*
      *
      *----------------------------------------------------------------*
       FILE                            SECTION.
      *----------------------------------------------------------------*
      *                                                                *
      *
      *----------------------------------------------------------------*
       WORKING-STORAGE                 SECTION.
      *----------------------------------------------------------------*
      *
      *----------------------------------------------------------------*
       01  FILLER                      PIC  X(050)     VALUE
           ' HBSI20BO - INICIO DA AREA DE WORKING '.
      *----------------------------------------------------------------*
      *
      *----------------------------------------------------------------*
       77  FILLER                      PIC X(050)      VALUE
           'AREA PARA VARIAVEIS AUXILIARES'.
      *----------------------------------------------------------------*
      *
       01  WRK-VAR-AUXILIARES.
           05 WRK-OPCAO                PIC X(002)      VALUE SPACES.
           05 WRK-AUX-MENU             PIC X(001)      VALUE "I".   
           
      *
      *----------------------------------------------------------------*
       01  FILLER                      PIC  X(050)     VALUE
           ' HBSI20BO - FIM DA AREA DE WORKING '.
      *----------------------------------------------------------------*
      *
      *----------------------------------------------------------------*
       SCREEN SECTION.
      *----------------------------------------------------------------*
      *
       01  TELA-VENDEDOR.
           05 VALUE "CADASTRO DE VENDEDORES"           
                                        BLANK SCREEN     LINE  2 COL  2.
           05 VALUE "01 - INCLUIR"                       LINE  4 COL  2.
           05 VALUE "02 - ALTERAR"                       LINE  5 COL  2.
           05 VALUE "03 - EXCLUIR"                       LINE  6 COL  2.
           05 VALUE "04 - IMPORTAR"                      LINE  7 COL  2.
           05 VALUE "05 - RETORNAR AO MENU ANTERIOR"     LINE  8 COL  2.
           05 VALUE "DIGITE A OPCAO DESEJADA:"           LINE 10 COL  2.
           05 OPCAO                                      LINE 10 COL 27
                                       PIC X(002) TO WRK-OPCAO.
      *
       01  TELA-VND-INCLUSAO.

       01  TELA-VND-ALTERACAO.

       01  TELA-VND-EXCLUSAO.

       01  TELA-VND-IMPORTACAO.

      *
      *================================================================*
       PROCEDURE DIVISION.                               
      *================================================================*
      *
      *----------------------------------------------------------------*
      *    ROTINA PRINCIPAL DO PROGRAMA                                *
      *----------------------------------------------------------------*
       0000-PRINCIPAL                  SECTION.
      *----------------------------------------------------------------*
      *
           PERFORM 1000-INICIALIZAR
           PERFORM 2000-PROCESSAR
           PERFORM 3000-FINALIZAR
           .
      *
      *----------------------------------------------------------------*
       0000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
      *
      *----------------------------------------------------------------*
      *    ROTINA INICIAL DO PROGRAMA                                  *
      *----------------------------------------------------------------*
       1000-INICIALIZAR                SECTION.
      *----------------------------------------------------------------*
      *
           .
      *
      *----------------------------------------------------------------*
       1000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
      *
      *----------------------------------------------------------------*
      *    PROCESSAMENTO PRINCIPAL DO PROGRAMA                         *
      *----------------------------------------------------------------*
       2000-PROCESSAR                  SECTION.
      *----------------------------------------------------------------*
      *
           PERFORM 2010-LOOP-MENU UNTIL WRK-AUX-MENU EQUAL "J".
      *
      *----------------------------------------------------------------*
       2000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
      *
      *----------------------------------------------------------------*
      *    ROTINA PARA MOSTRAR MENU PRINCIPAL DO CLIENTE               *
      *----------------------------------------------------------------*
       2010-LOOP-MENU                  SECTION.
      *----------------------------------------------------------------*
      *
           DISPLAY TELA-VENDEDOR
           ACCEPT TELA-VENDEDOR.
           EVALUATE WRK-OPCAO
              WHEN "01"
                  PERFORM 2100-INCLUIR-VND
              WHEN "02"
                  PERFORM 2200-ALTERAR-VND                              
              WHEN "03"
                  PERFORM 2300-EXCLUIR-VND
              WHEN "04"
                  PERFORM 2400-IMPORTA-VND
              WHEN "05"
                  PERFORM 3000-FINALIZAR
           END-EVALUATE.
      *
      *----------------------------------------------------------------*
       2010-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
      *
      *----------------------------------------------------------------*
      *    ROTINA PARA INCLUIR UM VENDEDOR                             *
      *----------------------------------------------------------------*
       2100-INCLUIR-VND                SECTION.
      *----------------------------------------------------------------*
      *
           .
      *
      *----------------------------------------------------------------*
       2100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
      *
      *----------------------------------------------------------------*
      *    ROTINA PARA ALTERAR UM VENDEDOR                             *
      *----------------------------------------------------------------*
       2200-ALTERAR-VND                SECTION.
      *----------------------------------------------------------------*
      *
           .
      *
      *----------------------------------------------------------------*
       2100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
      *
      *----------------------------------------------------------------*
      *    ROTINA PARA EXCLUIR UM VENDEDOR                             *
      *----------------------------------------------------------------*
       2300-EXCLUIR-VND                SECTION.
      *----------------------------------------------------------------*
      *
           .
      *
      *----------------------------------------------------------------*
       2100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
      *
      *----------------------------------------------------------------*
      *    ROTINA PARA IMPORTAR UM VENDEDOR                            *
      *----------------------------------------------------------------*
       2400-IMPORTA-VND                SECTION.
      *----------------------------------------------------------------*
      *
           .
      *
      *----------------------------------------------------------------*
       2100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
      *
      *----------------------------------------------------------------*
      *    ROTINA PARA FINALIZAR PROCESSAMENTO                         *
      *----------------------------------------------------------------*
       3000-FINALIZAR                  SECTION.
      *----------------------------------------------------------------*
      *
           EXIT PROGRAM.

      *----------------------------------------------------------------*
       3000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*