       program-id. HBSI100O as "HBSI100O".

       environment division.
       configuration section.

       data division.
       working-storage section.

       procedure division.

           display "Ola Github"

           goback.

       end program HBSI100O.
