      *================================================================*
       IDENTIFICATION                  DIVISION.
      *================================================================*
       PROGRAM-ID. HBSI20AO.
       AUTHOR.     TADEU COSTA DE OLIVEIRA.
      *================================================================*
      *           A V A L I A C A O - H B S I S / A M B E V            *
      *----------------------------------------------------------------*
      *    PROGRAMA....: HBSI20AO                                      *
      *    PROGRAMADOR.: TADEU COSTA DE OLIVEIRA                       *
      *    DATA........: 25/03/2019                                    *
      *----------------------------------------------------------------*
      *    OBJETIVO....: PROGRAMA PARA CADASTRO DE CLIENTES            *                                                                          
      *----------------------------------------------------------------*
      *    BOOKS USADOS:                                               *
      *    HBSINXXX - DESCRICAO DO BOOK                                *
      *----------------------------------------------------------------*
      *    MODULOS.....:                                               *
      *    HBSINXXX - DESCRICAO DO MODULO                              *
      *================================================================*
      *
      *================================================================*
       ENVIRONMENT                     DIVISION.
      *================================================================*
      *                                                                *
      *----------------------------------------------------------------*
       CONFIGURATION                   SECTION.
      *----------------------------------------------------------------*
      *
       SPECIAL-NAMES.
           DECIMAL-POINT               IS COMMA.
      *
      *================================================================*
       DATA                            DIVISION.
      *================================================================*
      *
      *----------------------------------------------------------------*
       FILE                            SECTION.
      *----------------------------------------------------------------*
      *                                                                *
      *
      *----------------------------------------------------------------*
       WORKING-STORAGE                 SECTION.
      *----------------------------------------------------------------*
      *
      *----------------------------------------------------------------*
       01  FILLER                      PIC  X(050)     VALUE
           ' HBSI20AO - INICIO DA AREA DE WORKING '.
      *----------------------------------------------------------------*
      *
      *----------------------------------------------------------------*
       77  FILLER                      PIC X(050)      VALUE
           'AREA PARA VARIAVEIS AUXILIARES'.
      *----------------------------------------------------------------*
      *
       01  WRK-VAR-AUXILIARES.
           05 WRK-OPCAO                PIC X(002)      VALUE SPACES.
           05 WRK-AUX-MENU             PIC X(001)      VALUE "I".
           05 WRK-IFUNCAO-CLI          PIC X(008)      VALUE SPACES.
           
      *
      *----------------------------------------------------------------*
       01  FILLER                      PIC  X(050)     VALUE
           ' HBSI20AO - FIM DA AREA DE WORKING '.
      *----------------------------------------------------------------*
      *
      *----------------------------------------------------------------*
       SCREEN SECTION.
      *----------------------------------------------------------------*
      *
       01  TELA-CLIENTE.
           05 VALUE "CADASTRO DE CLIENTES"             
                                       BLANK SCREEN      LINE  2 COL  2.
           05 VALUE "01 - INCLUIR"                       LINE  4 COL  2.
           05 VALUE "02 - ALTERAR"                       LINE  5 COL  2.
           05 VALUE "03 - EXCLUIR"                       LINE  6 COL  2.
           05 VALUE "04 - IMPORTAR"                      LINE  7 COL  2.
           05 VALUE "05 - RETORNAR AO MENU ANTERIOR"     LINE  8 COL  2.
           05 VALUE "DIGITE A OPCAO DESEJADA:"           LINE 10 COL  2.
           05 OPCAO                                      LINE 10 COL 27
                                       PIC X(002) TO WRK-OPCAO.
      *
       01  TELA-ACAO-CLIENTE.
           05 VALUE "CADASTRO DE CLIENTES - "
                                       BLANK SCREEN      LINE  2 COL  2.
           05 FUNCAO                                     LINE  2 COL 25
                                       PIC X(008) USING WRK-IFUNCAO-CLI.
           05 VALUE "CODIGO.......:"                     LINE  4 COL  2.
           05 VALUE "CNPJ.........:"                     LINE  5 COL  2.
           05 VALUE "RAZAO SOCIAL.:"                     LINE  6 COL  2.
           05 VALUE "LATITUDE.....:"                     LINE  7 COL  2.
           05 VALUE "LONGITUDE....:"                     LINE  8 COL  2.
      *
       01  TELA-CLI-IMPORTACAO.
      *
      *================================================================*
       PROCEDURE DIVISION.                               
      *================================================================*
      *
      *----------------------------------------------------------------*
      *    ROTINA PRINCIPAL DO PROGRAMA                                *
      *----------------------------------------------------------------*
       0000-PRINCIPAL                  SECTION.
      *----------------------------------------------------------------*
      *
           PERFORM 1000-INICIALIZAR
           PERFORM 2000-PROCESSAR
           PERFORM 3000-FINALIZAR
           .
      *
      *----------------------------------------------------------------*
       0000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
      *
      *----------------------------------------------------------------*
      *    ROTINA INICIAL DO PROGRAMA                                  *
      *----------------------------------------------------------------*
       1000-INICIALIZAR                SECTION.
      *----------------------------------------------------------------*
      *
           .
      *
      *----------------------------------------------------------------*
       1000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
      *
      *----------------------------------------------------------------*
      *    PROCESSAMENTO PRINCIPAL DO PROGRAMA                         *
      *----------------------------------------------------------------*
       2000-PROCESSAR                  SECTION.
      *----------------------------------------------------------------*
      *
           PERFORM 2010-LOOP-MENU UNTIL WRK-AUX-MENU EQUAL "J".
      *
      *----------------------------------------------------------------*
       2000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
      *
      *----------------------------------------------------------------*
      *    ROTINA PARA MOSTRAR MENU PRINCIPAL DO CLIENTE               *
      *----------------------------------------------------------------*
       2010-LOOP-MENU                  SECTION.
      *----------------------------------------------------------------*
      *
           DISPLAY TELA-CLIENTE
           ACCEPT TELA-CLIENTE.
           EVALUATE WRK-OPCAO
              WHEN "01"
                  PERFORM 2100-INCLUIR-CLI
              WHEN "02"
                  PERFORM 2200-ALTERAR-CLI                              
              WHEN "03"
                  PERFORM 2300-EXCLUIR-CLI
              WHEN "04"
                  PERFORM 2400-IMPORTA-CLI
              WHEN "05"
                  PERFORM 3000-FINALIZAR
           END-EVALUATE.
      *
      *----------------------------------------------------------------*
       2010-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
      *
      *----------------------------------------------------------------*
      *    ROTINA PARA INCLUIR UM CLIENTE                              *
      *----------------------------------------------------------------*
       2100-INCLUIR-CLI                SECTION.
      *----------------------------------------------------------------*
      *
           MOVE "INCLUSAO"             TO WRK-IFUNCAO-CLI
           DISPLAY TELA-ACAO-CLIENTE
           .
      *
      *----------------------------------------------------------------*
       2100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
      *
      *----------------------------------------------------------------*
      *    ROTINA PARA ALTERAR UM CLIENTE                              *
      *----------------------------------------------------------------*
       2200-ALTERAR-CLI                SECTION.
      *----------------------------------------------------------------*
      *
           .
      *
      *----------------------------------------------------------------*
       2100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
      *
      *----------------------------------------------------------------*
      *    ROTINA PARA EXCLUIR UM CLIENTE                              *
      *----------------------------------------------------------------*
       2300-EXCLUIR-CLI                SECTION.
      *----------------------------------------------------------------*
      *
           .
      *
      *----------------------------------------------------------------*
       2100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
      *
      *----------------------------------------------------------------*
      *    ROTINA PARA IMPORTAR UM CLIENTE                             *
      *----------------------------------------------------------------*
       2400-IMPORTA-CLI                SECTION.
      *----------------------------------------------------------------*
      *
           .
      *
      *----------------------------------------------------------------*
       2100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
      *
      *----------------------------------------------------------------*
      *    ROTINA PARA FINALIZAR PROCESSAMENTO                         *
      *----------------------------------------------------------------*
       3000-FINALIZAR                  SECTION.
      *----------------------------------------------------------------*
      *
           EXIT PROGRAM.

      *----------------------------------------------------------------*
       3000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*