      *================================================================*
       IDENTIFICATION                  DIVISION.
      *================================================================*
       PROGRAM-ID. HBSI20AO.
       AUTHOR.     TADEU COSTA DE OLIVEIRA.
      *================================================================*
      *           A V A L I A C A O - H B S I S / A M B E V            *
      *----------------------------------------------------------------*
      *    PROGRAMA....: HBSI20AO                                      *
      *    PROGRAMADOR.: TADEU COSTA DE OLIVEIRA                       *
      *    DATA........: 25/03/2019                                    *
      *----------------------------------------------------------------*
      *    OBJETIVO....: PROGRAMA PARA CADASTRO DE CLIENTES            *                                                                          
      *----------------------------------------------------------------*
      *    BOOKS USADOS:                                               *
      *    HBSINXXX - DESCRICAO DO BOOK                                *
      *----------------------------------------------------------------*
      *    MODULOS.....:                                               *
      *    HBSINXXX - DESCRICAO DO MODULO                              *
      *================================================================*
      *
      *================================================================*
       ENVIRONMENT                     DIVISION.
      *================================================================*
      *                                                                *
      *----------------------------------------------------------------*
       CONFIGURATION                   SECTION.
      *----------------------------------------------------------------*
      *
       SPECIAL-NAMES.
           DECIMAL-POINT               IS COMMA.
      *
      *================================================================*
       DATA                            DIVISION.
      *================================================================*
      *
      *----------------------------------------------------------------*
       FILE                            SECTION.
      *----------------------------------------------------------------*
      *                                                                *







      *
      *----------------------------------------------------------------*
       WORKING-STORAGE                 SECTION.
      *----------------------------------------------------------------*
      *
      *----------------------------------------------------------------*
       01  FILLER                      PIC  X(050)     VALUE
           ' HBSI20AO - INICIO DA AREA DE WORKING '.
      *----------------------------------------------------------------*
      *
      *----------------------------------------------------------------*
       77  FILLER                      PIC X(050)      VALUE
           'AREA PARA VARIAVEIS AUXILIARES'.
      *----------------------------------------------------------------*
      *
       01  WRK-VAR-AUXILIARES.
           05 WRK-OPCAO                PIC X(05)       VALUE SPACES.
           
             
               
                 
                   
                     
                       
                         
      *
      *----------------------------------------------------------------*
       01  FILLER                      PIC  X(050)     VALUE
           ' HBSI20AO - FIM DA AREA DE WORKING '.
      *----------------------------------------------------------------*
      *
      *----------------------------------------------------------------*
       SCREEN SECTION.
      *----------------------------------------------------------------*
      *
       01  TELA-CLIENTE.
           05 VALUE "SISTEMA DE CLIENTES E VENDEDORES" 
                                        BLANK SCREEN     LINE  2 COL  2.
           05 VALUE "MENU PRINCIAL"                      LINE  4 COL  2.
           05 VALUE "01.00 - CADASTROS"                  LINE  5 COL  2.
           05 VALUE "01.01 - CADASTRO DE CLIENTES"       LINE  6 COL  2.
           05 VALUE "01.02 - CADASTRO DE VENDEDORES"     LINE  7 COL  2.
           05 VALUE "02.00 - RELATORIOS"                 LINE  9 COL  2.
           05 VALUE "02.01 - RELATORIO DE CLIENTES"      LINE 10 COL  2.
           05 VALUE "02.02 - RELATORIO DE VENDEDORES"    LINE 11 COL  2.
           05 VALUE "03.00 - EXECUTAR"                   LINE 13 COL  2.
           05 VALUE "03.01 - EXECUTAR DISTRIBUICAO DE CLIENTES"  
                                                         LINE 14 COL  2.
           05 VALUE "99.99 - SAIR DO PROGRAMA"           LINE 16 COL  2.
           05 VALUE "DIGITE A OPCAO DESEJADA:"           LINE 18 COL  2.
           05 OPCAO                                      LINE 18 COL 28
                    PIC X(05) TO WRK-OPCAO.
      *
      *================================================================*
       PROCEDURE DIVISION.                               
      *================================================================*
      *
      *----------------------------------------------------------------*
      *    ROTINA PRINCIPAL DO PROGRAMA                                *
      *----------------------------------------------------------------*
       0000-PRINCIPAL                  SECTION.
      *----------------------------------------------------------------*
      *
           PERFORM 1000-INICIALIZAR
           PERFORM 2000-PROCESSAR
           PERFORM 3000-FINALIZAR
           .
      *
      *----------------------------------------------------------------*
       0000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
      *
      *----------------------------------------------------------------*
      *    ROTINA INICIAL DO PROGRAMA                                  *
      *----------------------------------------------------------------*
       1000-INICIALIZAR                SECTION.
      *----------------------------------------------------------------*
      *
           DISPLAY "Carregando o menu inicial".
           PERFORM 1010-LOOP-MENU UNTIL WRK-OPCAO EQUAL "99.99".
           .
      *
      *----------------------------------------------------------------*
       1000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
      *
      *----------------------------------------------------------------*
       1010-LOOP-MENU                  SECTION.
      *----------------------------------------------------------------*
      *
           DISPLAY TELA-CLIENTE
           ACCEPT TELA-CLIENTE.
           EVALUATE WRK-OPCAO
              WHEN "01.01"
                  DISPLAY "CADASTRO CLIENTE"
              WHEN "01.02"
                  DISPLAY "CADASTRO VENDEDOR"
              WHEN "02.01"
                  DISPLAY "RELATORIO CLIENTE"
              WHEN "02.02"
                  DISPLAY "RELATORIO VENDEDOR"
              WHEN "03.00"
                  DISPLAY "EXECUCAO"
           END-EVALUATE.
      *
      *----------------------------------------------------------------*
       1010-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
      *
      *----------------------------------------------------------------*
      *    PROCESSAMENTO PRINCIPAL DO PROGRAMA                         *
      *----------------------------------------------------------------*
       2000-PROCESSAR                  SECTION.
      *----------------------------------------------------------------*
      *
           DISPLAY "Processando".
      *
      *----------------------------------------------------------------*
       2000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
      *
      *----------------------------------------------------------------*
      *    ROTINA PARA FINALIZAR PROCESSAMENTO                         *
      *----------------------------------------------------------------*
       3000-FINALIZAR                  SECTION.
      *----------------------------------------------------------------*
      *
           STOP RUN.

      *----------------------------------------------------------------*
       3000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*